var sum = ''
for (var i = 0; i < 7; i++){
    if(i == 0) sum = sum + '#' + '\n'
    if(i == 1) {
         for (var j = 0; j < 2; j++){
             sum = sum + '#'
         }
         sum = sum + '\n'
     }
     if(i == 2) {
         for (var j = 0; j < 3; j++){
             sum = sum + '#'
         }
         sum = sum + '\n'
     }
     if(i == 3) {
         for (var j = 0; j < 4; j++){
             sum = sum + '#'
         }
         sum = sum + '\n'
     }
     if (i == 4){
         for (var j = 0; j < 5; j++){
             sum = sum + "#"
         }
         sum = sum + '\n'
     }
     if (i == 5){
         for (var j = 0; j < 6; j++){
             sum = sum + "#"
         }
         sum = sum + '\n'
     }
     if (i == 6){
        for (var j = 0; j < 7; j++){
            sum = sum + "#"
        }
        sum = sum + '\n'
    }
    if (i == 7){
        for (var j = 0; j < 8; j++){
            sum = sum + "#"
        }
        sum = sum + '\n'
    }
 }
 console.log(sum)


 //Бонусная задача
var sum = "";
for (var i = 0; i<12;i++){
    if(i == 0){
         sum = sum +'"' + '#############################' +'"' + '\n'
    }
    if (i == 1){
        sum = sum +'"'+ "#####"+ "                  " +"######"+'"'+ '\n'
    }
    if (i == 2){
        sum = sum + '"' + "##" + "   " + "***" + "                 " + "**" + "##" + '"' + '\n'
    }
    if (i == 3){
        sum = sum +'"'+ "#"+ "   "+ "*##**"+ "          "+ "**"+ "  "+ "O"+ "  "+ "*##" +'"'+'\n'
    }
    if (i == 4){
        sum = sum + '"'+ "#"+"    "+"***"+"     "+"O"+"     "+"##**"+"    "+"*#"+'"'+'\n'
    }
    if (i == 5){
        sum = sum + '"'+"#"+"       "+"O"+"          "+"##***"+"    "+"#"+'"'+'\n'
    }
    if ( i == 6){
        sum = sum + '"'+"#"+"                  "+"##**"+"     "+"#"+'"'+'\n'
    }
    if ( i == 7){
        sum = sum + '"'+"#"+"   "+"O"+"       "+"#*"+"              "+"#"+'"'+'\n'
    }
    if ( i == 8){
        sum = sum + '"'+"#"+ "*"+"          "+"#**"+"        "+"O"+"    "+"#"+'"'+'\n'
    }
    if ( i == 9){
        sum = sum + '"'+"#"+"***"+"        "+"##**"+"     "+"O"+"    "+"**"+"#"+'"'+'\n'
    }
    if ( i == 10){
        sum = sum + '"'+"#"+"#****"+"     "+"###***"+"        "+"*##"+"#"+'"'+'\n'
    }
    if ( i == 11){
        sum = sum +'"' + '#############################' +'"' + '\n'
    }
} 
console.log(sum);